MHalemDEV2024/STM32_Peripheral_Drivers/drivers/Src/usart.c

#include "stm32f429xx.h"
#include <stddef.h>


/*************************************************************************************************
 * @fn      		      - USART_SetBaudRate
 *
 * @brief             - Configures the baud rate for the specified USART peripheral.
 * 
 * This function calculates and sets the baud rate for the USART peripheral based on
 * the peripheral clock and desired baud rate. It supports both oversampling by 8 and 16.
 *
 * @param[in]         - pUSARTx: Pointer to USART peripheral register definition structure.
 *                      This identifies which USART instance to configure.
 * @param[in]         - BaudRate: Desired baud rate for communication.
 *
 * @return            - None
 *
 * @Note              - The function checks the USART_CR1_OVER8 bit to determine
 *                      whether the oversampling is 8 or 16, and calculates the 
 *                      baud rate accordingly.
 ****************************************************************************************************/
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{
    // Variable to hold the APB clock
    uint32_t PCLKx;

    // Variable to hold USARTDIV value
    uint32_t usartdiv;

    // Variables to hold Mantissa and Fraction values
    uint32_t M_part, F_part;

    // Temporary register for BRR value
    uint32_t tempreg = 0;

    // 1. Get the APB clock value into PCLKx based on which USART instance is used
    if (pUSARTx == USART1 || pUSARTx == USART6)
    {
        // USART1 and USART6 are connected to APB2
        PCLKx = RCC_GetPCLK2Value();
    }
    else
    {
        // Other USART peripherals (e.g., USART2, USART3) are connected to APB1
        PCLKx = RCC_GetPCLK1Value();
    }

    // 2. Check the OVER8 bit (oversampling by 8 or 16) in USART_CR1
    if (pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
        // OVER8 = 1, oversampling by 8
        usartdiv = (25 * PCLKx) / (2 * BaudRate);
    }
    else
    {
        // Oversampling by 16 (default)
        usartdiv = (25 * PCLKx) / (4 * BaudRate);
    }

    // 3. Calculate the Mantissa part (integer part of USARTDIV)
    M_part = usartdiv / 100;

    // 4. Load Mantissa part into the temporary register (BRR[15:4])
    tempreg |= M_part << 4;

    // 5. Extract the Fractional part
    F_part = usartdiv - (M_part * 100);

    // 6. Adjust Fractional part based on oversampling mode
    if (pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
        // OVER8 = 1, fractional part is out of 8
        F_part = (((F_part * 8) + 50) / 100) & 0x07; // Round and mask to 3 bits
    }
    else
    {
        // Oversampling by 16, fractional part is out of 16
        F_part = (((F_part * 16) + 50) / 100) & 0x0F; // Round and mask to 4 bits
    }

    // 7. Load Fractional part into the temporary register (BRR[3:0])
    tempreg |= F_part;

    // 8. Write the final value to the BRR register
    pUSARTx->BRR = tempreg;
}


/************************************************************************************************************************
 * @fn      		  - USART_Init
 *
 * @brief             - Initializes the given USART peripheral with the specified configuration.
 * 
 * This function configures various settings of the USART peripheral such as 
 * mode (TX/RX), baud rate, word length, parity control, stop bits, and hardware flow control.
 *
 * @param[in]         - pUSARTHandle: Pointer to a USART handle structure that contains
 *                      the configuration settings for the USART peripheral.
 *
 * @return            - None
 *
 * @Note              - Ensure that the clock for the USART peripheral is enabled before using this function.
 **********************************************************************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle)
{
    // Temporary variable to hold register configurations
    uint32_t tempreg = 0;

/******************************** Configuration of CR1 ******************************************/

    // 1. Enable the clock for the given USART peripheral
    USART_PeriClockControl(pUSARTHandle->pUSARTx, ENABLE);

    // 2. Enable USART Tx and/or Rx engines based on the USART_Mode configuration
    if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
    {
        // Enable the Receiver bit field (RE)
        tempreg |= (1 << USART_CR1_RE);
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
    {
        // Enable the Transmitter bit field (TE)
        tempreg |= (1 << USART_CR1_TE);
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
    {
        // Enable both Transmitter and Receiver bit fields (TE and RE)
        tempreg |= ((1 << USART_CR1_RE) | (1 << USART_CR1_TE));
    }

    // 3. Configure the Word length (8 or 9 bits)
    tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M;

    // 4. Configure the Parity control
    if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
    {
        // Enable parity control (PCE)
        tempreg |= (1 << USART_CR1_PCE);
        // No need to configure for even parity as it's default
    }
    else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD)
    {
        // Enable parity control (PCE) and select odd parity (PS)
        tempreg |= (1 << USART_CR1_PCE);
        tempreg |= (1 << USART_CR1_PS);
    }

    // 5. Program the CR1 register with the above settings
    pUSARTHandle->pUSARTx->CR1 = tempreg;

/******************************** Configuration of CR2 ******************************************/

    // Reset the tempreg for CR2 configuration
    tempreg = 0;

    // 6. Configure the number of stop bits
    tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;

    // 7. Program the CR2 register
    pUSARTHandle->pUSARTx->CR2 = tempreg;

/******************************** Configuration of CR3 ******************************************/

    // Reset the tempreg for CR3 configuration
    tempreg = 0;

    // 8. Configure hardware flow control
    if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
    {
        // Enable CTS flow control (CTSE)
        tempreg |= (1 << USART_CR3_CTSE);
    }
    else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
    {
        // Enable RTS flow control (RTSE)
        tempreg |= (1 << USART_CR3_RTSE);
    }
    else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
    {
        // Enable both CTS and RTS flow control (CTSE and RTSE)
        tempreg |= (1 << USART_CR3_CTSE);
        tempreg |= (1 << USART_CR3_RTSE);
    }

    // 9. Program the CR3 register
    pUSARTHandle->pUSARTx->CR3 = tempreg;

/******************************** Configuration of BRR (Baud Rate Register) ******************************************/

