MHalemDEV2024/STM32_Peripheral_Drivers/drivers/Src/usart.c
    // 10. Configure the baud rate using the helper function
    USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}





/*********************************************************************
 * @fn      		  - USART_PeripheralControl
 *
 * @brief             - Enables or disables the specified USART peripheral.
 *
 * This function allows for the control of the USART peripheral by enabling 
 * or disabling it. It modifies the CR1 register to either set or clear the 
 * USART enable bit based on the command provided.
 *
 * @param[in]         - pUSARTx: Pointer to the USART peripheral's register 
 *                      definition structure.
 *
 * @param[in]         - Cmd: Command to enable or disable the USART. 
 *                      It can take the following values:
 *                      - ENABLE: To enable the USART peripheral.
 *                      - DISABLE: To disable the USART peripheral.
 *
 * @return            - None
 *
 * @Note              - Ensure that the USART peripheral is properly initialized 
 *                      before calling this function.
 *********************************************************************/
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t Cmd)
{
    if(Cmd == ENABLE)
    {
        // Set the UE (USART Enable) bit in the CR1 register
        pUSARTx->CR1 |= (1 << 13);
    }
    else
    {
        // Clear the UE (USART Enable) bit in the CR1 register
        pUSARTx->CR1 &= ~(1 << 13);
    }
}


/*********************************************************************
 * @fn      		  - USART_PeriClockControl
 *
 * @brief             - Controls the clock for a specified USART peripheral.
 *
 * This function enables or disables the clock for the specified USART 
 * peripheral based on the provided command. When enabling, it sets 
 * the relevant clock enable bit in the RCC. When disabling, it clears 
 * the corresponding clock enable bit.
 *
 * @param[in]         - pUSARTx: Pointer to the USART peripheral's 
 *                      register definition structure. Valid options include:
 *                      - USART1
 *                      - USART2
 *                      - USART3
 *                      - UART4
 *                      - UART5
 *                      - USART6
 *                      - UART7
 *                      - UART8
 *
 * @param[in]         - EnorDi: Command to enable or disable the clock. 
 *                      It can take the following values:
 *                      - ENABLE: To enable the clock for the specified USART.
 *                      - DISABLE: To disable the clock for the specified USART.
 *
 * @return            - None
 *
 * @Note              - Ensure the relevant clock control macros are defined 
 *                      for each USART peripheral.
 *
 * @TODO              - Implement the functionality to disable the clock 
 *                      for the specified USART. This may involve 
 *                      adding code to clear the clock enable bits 
 *                      for each USART peripheral in the respective 
 *                      clock control register.
 *********************************************************************/
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        // Enable clock for the specified USART
        if (pUSARTx == USART1)
        {
            USART1_PCLK_EN();  // Enable clock for USART1
        }
        else if (pUSARTx == USART2)
        {
            USART2_PCLK_EN();  // Enable clock for USART2
        }
        else if (pUSARTx == USART3)
        {
            USART3_PCLK_EN();  // Enable clock for USART3
        }
        else if (pUSARTx == UART4)
        {
            UART4_PCLK_EN();   // Enable clock for UART4
        }
        else if (pUSARTx == UART5)
        {
            UART5_PCLK_EN();   // Enable clock for UART5
        }
        else if (pUSARTx == USART6)
        {
            USART6_PCLK_EN();  // Enable clock for USART6
        }
        else if (pUSARTx == UART7)
        {
            UART7_PCLK_EN();   // Enable clock for UART7
        }
        else if (pUSARTx == UART8)
        {
            UART8_PCLK_EN();   // Enable clock for UART8
        }
    }
    else // EnorDi == DISABLE
    {
			
        // Disable clock for the specified USART
        if (pUSARTx == USART1)
        {
            USART1_PCLK_DI();  // Disable clock for USART1
        }
        else if (pUSARTx == USART2)
        {
            USART2_PCLK_DI();  // Disable clock for USART2
        }
        else if (pUSARTx == USART3)
        {
            USART3_PCLK_DI();  // Disable clock for USART3
        }
        else if (pUSARTx == UART4)
        {
            UART4_PCLK_DI();   // Disable clock for UART4
        }
        else if (pUSARTx == UART5)
        {
            UART5_PCLK_DI();   // Disable clock for UART5
        }
        else if (pUSARTx == USART6)
        {
            USART6_PCLK_DI();  // Disable clock for USART6
        }
        else if (pUSARTx == UART7)
        {
            UART7_PCLK_DI();   // Disable clock for UART7
        }
        else if (pUSARTx == UART8)
        {
            UART8_PCLK_DI();   // Disable clock for UART8
        }
    }
}


/*********************************************************************
 * @fn      		  - USART_GetFlagStatus
 *
 * @brief             - Checks the status of a specific USART flag.
 *
 * This function reads the status register (SR) of the specified USART 
 * peripheral to determine the current state of a given flag. 
 * It returns a status indicating whether the flag is set or reset.
 *
 * @param[in]         - pUSARTx: Pointer to the USART peripheral's 
 *                      register definition structure. Valid options include:
 *                      - USART1
 *                      - USART2
 *                      - USART3
 *                      - UART4
 *                      - UART5
 *                      - USART6
 *                      - UART7
 *                      - UART8
 *
 * @param[in]         - StatusFlagName: The specific flag to check. 
 *                      This should be one of the USART status flag constants.
 *
 * @return            - Returns SET if the specified flag is set, 
 *                      otherwise returns RESET.
 *
 * @Note              - Ensure that the relevant flag constants are defined 
 *                      for the USART peripheral.
 *********************************************************************/
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint8_t StatusFlagName)
{
    // Check if the specified flag is set in the status register
    if (pUSARTx->SR & StatusFlagName)
    {
        return SET;  // Flag is set
    }

