MHalemDEV2024/STM32_Peripheral_Drivers/drivers/Src/usart.c
    return RESET;  // Flag is not set
}




/*********************************************************************
 * @fn      		  - USART_Config
 *
 * @brief             - Configures the specified USART interface with custom settings.
 *
 * This function sets up the USART peripheral based on the input parameters, 
 * such as baud rate, hardware flow control, mode, stop bits, word length, 
 * and parity control. It supports configuring any USART peripheral (e.g., 
 * USART1, USART2, etc.) dynamically at runtime.
 *
 * @param[in]         - pUSARTx: Pointer to the USART peripheral (e.g., USART1, USART2).
 *
 * @param[in]         - baud_rate: Baud rate to be configured for the USART.
 *
 * @param[in]         - hw_flow_control: Hardware flow control configuration 
 *                      (e.g., USART_HW_FLOW_CTRL_NONE, USART_HW_FLOW_CTRL_RTS_CTS).
 *
 * @param[in]         - mode: Specifies the mode of operation for the USART 
 *                      (e.g., USART_MODE_ONLY_TX, USART_MODE_ONLY_RX, USART_MODE_TXRX).
 *
 * @param[in]         - stop_bits: Specifies the number of stop bits 
 *                      (e.g., USART_STOPBITS_1, USART_STOPBITS_2).
 *
 * @param[in]         - word_length: Specifies the word length (e.g., USART_WORDLEN_8BITS, USART_WORDLEN_9BITS).
 *
 * @param[in]         - parity_control: Specifies the parity control 
 *                      (e.g., USART_PARITY_DISABLE, USART_PARITY_EVEN, USART_PARITY_ODD).
 *
 * @return            - None
 *
 * @Note              - Ensure the clock for the respective USART is enabled before 
 *                      calling this function. The function must be called after 
 *                      peripheral reset and before data transmission or reception.
 *********************************************************************/
// Define the USART handle
USART_Handle_t usart_handle;

void USART_Config(USART_RegDef_t *pUSARTx, uint32_t baud_rate, uint8_t hw_flow_control, uint8_t mode, uint8_t stop_bits, uint8_t word_length, uint8_t parity_control) {


    // Assign the USART peripheral base address
    usart_handle.pUSARTx = pUSARTx;

    // Configure the USART parameters dynamically based on input arguments
    usart_handle.USART_Config.USART_Baud = baud_rate;
    usart_handle.USART_Config.USART_HWFlowControl = hw_flow_control;
    usart_handle.USART_Config.USART_Mode = mode;
    usart_handle.USART_Config.USART_NoOfStopBits = stop_bits;
    usart_handle.USART_Config.USART_WordLength = word_length;
    usart_handle.USART_Config.USART_ParityControl = parity_control;

    // Initialize the USART with the configured parameters
    USART_Init(&usart_handle);
}


/*********************************************************************
 * @fn      		  - USART_SendData
 *
 * @brief             - Transmits data over the specified USART interface.
 *
 * This function sends a specified length of data through the USART 
 * peripheral. It handles both 8-bit and 9-bit data formats based on 
 * the configuration settings. The function waits for the transmit 
 * data register to be empty before sending each byte and checks for 
 * the transmission complete flag to ensure the entire buffer has been 
 * transmitted before returning.
 *
 * @param[in]         - pUSARTHandle: Pointer to the USART handle structure
 *                      containing configuration and peripheral information.
 *
 * @param[in]         - pTxBuffer: Pointer to the data buffer to be transmitted.
 *
 * @param[in]         - Len: Number of bytes to be transmitted from the buffer.
 *
 * @return            - None
 *
 * @Note              - Ensure that the USART peripheral is properly 
 *                      initialized before calling this function.
 *********************************************************************/


void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{
    uint16_t *pdata;

    // Loop over until "Len" number of bytes are transferred
    for (uint32_t i = 0; i < Len; i++)
    {
        // Wait until TXE flag is set in the SR
        while (!USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_TXE));

        // Check the USART_WordLength for 9BIT or 8BIT in a frame
        if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            // Load the DR with 2 bytes, masking bits other than first 9 bits
            pdata = (uint16_t*)pTxBuffer;
            pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

            // Check for USART_ParityControl
            if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                // No parity is used in this transfer, so 9 bits of user data will be sent
                // Increment pTxBuffer twice for the 9-bit data
                pTxBuffer++;
                pTxBuffer++;
            }
            else
            {
                // Parity bit is used in this transfer, so 8 bits of user data will be sent
                // The 9th bit will be replaced by parity bit by the hardware
                pTxBuffer++;
            }
        }
        else
        {
            // This is an 8-bit data transfer
            pUSARTHandle->pUSARTx->DR = (*pTxBuffer & (uint8_t)0xFF);

            // Increment the buffer address for the next byte
            pTxBuffer++;
        }
    }

    // Wait till TC flag is set in the SR
    while (!USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_TC));
}


/*********************************************************************
 * @fn      		  - USART_ReceiveData
 *
 * @brief             - Receives data from the specified USART interface.
 *
 * This function reads a specified number of bytes from the USART 
 * peripheral into the provided buffer. It handles both 8-bit and 
 * 9-bit data formats based on the configuration settings. The function
 * waits for the receive data register to be not empty before reading 
 * each byte.
 *
 * @param[in]         - pUSARTHandle: Pointer to the USART handle structure
 *                      containing configuration and peripheral information.
 *
 * @param[in]         - pRxBuffer: Pointer to the buffer where received data 
 *                      will be stored.
 *
 * @param[in]         - Len: Number of bytes to be received into the buffer.
 *
 * @return            - None
 *
 * @Note              - Ensure that the USART peripheral is properly 
 *                      initialized before calling this function.
 *********************************************************************/
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
    // Loop over until "Len" number of bytes are received
    for (uint32_t i = 0; i < Len; i++)
    {
        // Wait until RXNE flag is set in the SR
        while (!USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_RXNE));

        // Check the USART_WordLength to decide whether we are going to receive 
        // 9 bits of data in a frame or 8 bits
        if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            // We are going to receive 9-bit data in a frame

            // Check if we are using USART_ParityControl or not
            if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                // No parity is used, so all 9 bits will be of user data
                // Read only first 9 bits, so mask the DR with 0x01FF
                *((uint16_t*)pRxBuffer) = (pUSARTHandle->pUSARTx->DR & (uint16_t)0x01FF);

                // Increment the pRxBuffer two times for 9-bit data
                pRxBuffer++;
                pRxBuffer++;
            }
            else
            {
                // Parity is used, so 8 bits will be user data and 1 bit is parity
                *pRxBuffer = (pUSARTHandle->pUSARTx->DR & (uint8_t)0xFF);
                pRxBuffer++;
            }
        }
        else
        {
            // We are going to receive 8-bit data in a frame

            // Check if we are using USART_ParityControl or not
            if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                // No parity is used, so all 8 bits will be user data
                // Read 8 bits from DR
                *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->DR & (uint8_t)0xFF);
            }
            else
            {
                // Parity is used, so 7 bits will be user data and 1 bit is parity
                // Read only 7 bits, hence mask the DR with 0x7F
                *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->DR & (uint8_t)0x7F);
            }

            // Increment the pRxBuffer for the next byte
            pRxBuffer++;
        }
    }
}

/*********************************************************************
 * @fn      		  - USART_SendDataIT
 *
 * @brief             - Initiates the transmission of data over USART
 *                      using interrupt-driven methods.
 *
 * This function sets up the USART for transmitting a specified length 
 * of data from the provided buffer using interrupts. It first checks 
 * if the USART is currently busy in transmission. If not, it updates 
 * the transmission state, sets the length and buffer, and enables 
 * the necessary transmission interrupts.
 *
 * @param[in]         - pUSARTHandle: Pointer to the USART handle structure 
 *                      containing configuration and peripheral information.
 *
 * @param[in]         - pTxBuffer: Pointer to the buffer containing data to 
 *                      be transmitted.
 *
 * @param[in]         - Len: Number of bytes to be transmitted from the buffer.
 *
 * @return            - uint8_t: The current state of the transmission 
 *                      (e.g., USART_BUSY_IN_TX if busy, otherwise 
 *                      previous state).
 *
 * @Note              - The interrupt handlers for TXE and TC must be 
 *                      properly implemented to manage the transmission 
 *                      process.
 *********************************************************************/
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{
    // Get the current transmission state
    uint8_t txstate = pUSARTHandle->TxBusyState;

    // Check if USART is not busy in transmission
    if (txstate != USART_BUSY_IN_TX)
    {
        // Set up the transmission parameters
        pUSARTHandle->TxLen = Len;              // Set the length of data to be transmitted
        pUSARTHandle->pTxBuffer = pTxBuffer;    // Set the transmission buffer
        pUSARTHandle->TxBusyState = USART_BUSY_IN_TX; // Mark as busy in transmission

        // Enable interrupt for TXE (Transmit Data Register Empty)
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TXEIE);

        // Enable interrupt for TC (Transmission Complete)
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TCIE);
    }

    return txstate; // Return the current transmission state
}


/*********************************************************************
 * @fn      		  - USART_ReceiveDataIT
 *
 * @brief             - Initiates the reception of data over USART
 *                      using interrupt-driven methods.
 *
 * This function sets up the USART for receiving a specified length 
 * of data into the provided buffer using interrupts. It first checks 
 * if the USART is currently busy in reception. If not, it updates 
 * the reception state, sets the length and buffer, and enables 
 * the necessary reception interrupts.
 *
 * @param[in]         - pUSARTHandle: Pointer to the USART handle structure 
 *                      containing configuration and peripheral information.
 *
 * @param[in]         - pRxBuffer: Pointer to the buffer where received data 
 *                      will be stored.
 *
 * @param[in]         - Len: Number of bytes to be received into the buffer.
 *
 * @return            - uint8_t: The current state of the reception 
 *                      (e.g., USART_BUSY_IN_RX if busy, otherwise 
 *                      previous state).
 *
 * @Note              - The interrupt handler for RXNE must be properly 
 *                      implemented to manage the reception process.
 *********************************************************************/
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
    // Get the current reception state
    uint8_t rxstate = pUSARTHandle->RxBusyState;

    // Check if USART is not busy in reception
    if (rxstate != USART_BUSY_IN_RX)
    {
        // Set up the reception parameters
        pUSARTHandle->RxLen = Len;              // Set the length of data to be received
        pUSARTHandle->pRxBuffer = pRxBuffer;    // Set the reception buffer
        pUSARTHandle->RxBusyState = USART_BUSY_IN_RX; // Mark as busy in reception

