MHalemDEV2024/STM32_Peripheral_Drivers/drivers/Src/usart.c
        // Clear the data register (optional, ensures the first read is valid)
        (void)pUSARTHandle->pUSARTx->DR; 

        // Enable interrupt for RXNE (Receive Data Register Not Empty)
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_RXNEIE);
    }

    return rxstate; // Return the current reception state
}


/*********************************************************************
 * @fn      		  - USART_ClearFlag
 *
 * @brief             - Clears specified status flags in the USART status register.
 *
 * This function clears the given status flag(s) in the USART's status 
 * register by performing a bitwise AND operation with the complement 
 * of the specified flag. It is applicable for specific flags like 
 * USART_CTS_FLAG, USART_LBD_FLAG, USART_TC_FLAG, and others.
 *
 * @param[in]         - pUSARTx: Pointer to the USART peripheral's register 
 *                      definition structure.
 *
 * @param[in]         - StatusFlagName: The status flag(s) to be cleared. 
 *                      This should be one of the predefined status flag 
 *                      constants such as USART_CTS_FLAG, USART_LBD_FLAG, 
 *                      USART_TC_FLAG, etc.
 *
 * @return            - void: This function does not return a value.
 *
 * @Note              - This function is designed to be used with status 
 *                      flags that can be cleared by writing to the SR 
 *                      register.
 *********************************************************************/
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)
{
    // Clear the specified status flag by masking it out in the SR register
    pUSARTx->SR &= ~(StatusFlagName);
}

